#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("Документ ""Выдача пластиковых карт"": Проверка проведения").ВТранзакции() 
  	.ДобавитьТест("ПроверкаЗаписиПозитив")
   	.ДобавитьТест("ПроверкаЗаписиНегатив")
  	.ДобавитьТест("ПроверкаПроведенияПозитив")
   	.ДобавитьТест("ПроверкаПроведенияНегатив")
	;

КонецПроцедуры 

Процедура ПроверкаЗаписиПозитив() Экспорт
	
	ЗаявкаНаВыдачуКарт = Ютест.Данные().КонструкторОбъекта("Документы.ВыдачаПластиковыхКарт")
	.ФикцияОбязательныхПолей()
	.ФикцияРеквизитов("Организация, Контрагент, ВидКарты, Статус, ВидЛояльности")
	.Установить("Дата", ТекущаяДатаСеанса())
	.Записать()
	;
	
	Ютест.ОжидаетЧто(ЗаявкаНаВыдачуКарт.ПолучитьОбъект())
	.Метод("Записать")
  	.НеВыбрасываетИсключение()


КонецПроцедуры   

Процедура ПроверкаЗаписиНегатив() Экспорт

	ЗаявкаНаВыдачуКарт = Ютест.Данные().КонструкторОбъекта("Документы.ВыдачаПластиковыхКарт")
	//.ФикцияОбязательныхПолей()
	//   .ФикцияРеквизитов("Покупатель, Склад, Валюта, ВидЦен, ОбоснованиеОтгрузки, Организация")
	.Установить("Дата", ТекущаяДатаСеанса())
	//.Записать()
	;
	
	Ютест.ОжидаетЧто(ЗаявкаНаВыдачуКарт)
	.Метод("Записать") 
		.Параметр(РежимзаписиДокумента.Запись)
  	.ВыбрасываетИсключение("")
	;
  
КонецПроцедуры

Процедура ПроверкаПроведенияПозитив() Экспорт

	ЗаявкаНаВыдачуКарт = Ютест.Данные().КонструкторОбъекта("Документы.ВыдачаПластиковыхКарт")
	.ФикцияОбязательныхПолей()
	.ФикцияРеквизитов("Организация, Контрагент, ВидКарты, Статус, ВидЛояльности")
	.Установить("Дата", ТекущаяДатаСеанса())
	.Записать()
	;
	
	Ютест.ОжидаетЧто(ЗаявкаНаВыдачуКарт.ПолучитьОбъект())
		.Метод("Записать")
			.Параметр(РежимзаписиДокумента.Проведение)
			.Параметр(РежимПроведенияДокумента.Оперативный)
  	.НеВыбрасываетИсключение()
	;

КонецПроцедуры   

Процедура ПроверкаПроведенияНегатив() Экспорт
	
	ЗаявкаНаВыдачуКарт = Ютест.Данные().КонструкторОбъекта("Документы.ВыдачаПластиковыхКарт")
	//.ФикцияРеквизитов("Контрагент, ВидКарты, Статус, ВидЛояльности")
	.Установить("Дата", ТекущаяДатаСеанса())
	.Установить("Организация", Неопределено)
	.Записать()
	;
	                                         
	Ютест.ОжидаетЧто(ЗаявкаНаВыдачуКарт.ПолучитьОбъект())
		.Метод("Записать")
			.Параметр(РежимзаписиДокумента.Проведение)
			.Параметр(РежимПроведенияДокумента.Оперативный)
  		.ВыбрасываетИсключение("")
	;

КонецПроцедуры

#КонецОбласти