
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаВыдачуКарт") Тогда
		ВидКарты = ДанныеЗаполнения.ВидКарты;
		ВидЛояльности = ДанныеЗаполнения.ВидЛояльности;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Основание = ДанныеЗаполнения; 
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.СтатусыВыдачиПластиковыхКарт.Новый Тогда
		Возврат;
	КонецЕсли;

	Если Статус = Перечисления.СтатусыВыдачиПластиковыхКарт.Обработано Тогда
		ДокОснование = Основание.ПолучитьОбъект();
		ДокОснование.Статус = Перечисления.СтатусыЗаявокНаВыдачуКарт.Обработано;
		ДокОснование.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КартыЛояльности.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КартыЛояльности КАК КартыЛояльности
	|ГДЕ
	|	КартыЛояльности.ДокументОснование = &ДокументОснование
	|	И Не КартыЛояльности.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		КартаЛояльности = Справочники.КартыЛояльности.СоздатьЭлемент();
		КартаЛояльности.КомуВыдана	= Контрагент;
		КартаЛояльности.ВидКарты = ВидКарты;
		КартаЛояльности.Активна = Ложь; 
		КартаЛояльности.ВидЛояльности = ВидЛояльности;      
		КартаЛояльности.ДокументОснование = Ссылка;
		КартаЛояльности.Записать();
	КонецЕсли;

КонецПроцедуры  


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КартыЛояльности.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КартыЛояльности КАК КартыЛояльности
	|ГДЕ
	|	КартыЛояльности.ДокументОснование = &ДокументОснование
	|	И Не КартыЛояльности.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 

	Если Выборка.Следующий() Тогда
		Карта = Выборка.Ссылка.ПолучитьОбъектЩ();
		Карта.ПометкаУаделния = Истина;
		Карта.Записать();
	КонецЕсли;
	
	ДокОснование = Основание.ПолучитьОбъект();
	ДокОснование.Статус = Перечисления.СтатусыЗаявокНаВыдачуКарт.Новый;
	ДокОснование.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

