Процедура ЗагрузитьОбъект(Объект) Экспорт

	Если Не ЗначениеЗаполнено(Объект.ТекстСообщения)
		Или Не ЗначениеЗаполнено(Объект.Дата) Тогда	
		Возврат;		
	КонецЕсли;

	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(Объект.ТекстСообщения);
	ОтветВСтруктуре1С = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();

	// Создаем контрагента
	КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	КонтрагентОбъект.Наименование = ОтветВСтруктуре1С.Фамилия + " " + ОтветВСтруктуре1С.Имя + " " + ОтветВСтруктуре1С.Отчество;
	КонтрагентОбъект.Телефон = ОтветВСтруктуре1С.ТелНомер;
	КонтрагентОбъект.ЭлектроннаяПочта = ОтветВСтруктуре1С.ЭлектроннаяПочта;
 	КонтрагентОбъект.ФактическийАдрес = ОтветВСтруктуре1С.ФактическийАдрес;
	КонтрагентОбъект.ЮридическийАдрес = ОтветВСтруктуре1С.ЮридическийАдрес;
	КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидКонтрагента.ФизическоеЛицо; 
	КонтрагентОбъект.ВидЦен = Справочники.ВидыЦен.Закупочная;
	КонтрагентОбъект.Записать();
	
	ДокОбъект =  Документы.ЗаявкаНаВыдачуКарт.СоздатьДокумент(); 
	ДокОбъект.Дата = Объект.Дата; 
	ДокОбъект.Организация = Константы.ОсновнаяОрганизация.Получить(); 
	ДокОбъект.Контрагент = КонтрагентОбъект.Ссылка; 
	ДокОбъект.ВидКарты = Перечисления.ВидыКартЛояльности.Электронная;
	ДокОбъект.Статус = Перечисления.СтатусыЗаявокНаВыдачуКарт.Новый;
	Если ОтветВСтруктуре1С.ВидЛояльности = 1 Тогда
      ДокОбъект.ВидЛояльности = Перечисления.ВидыЛояльностей.Скидочная;
	ИначеЕсли ОтветВСтруктуре1С.ВидЛояльности = 2 Тогда 
      ДокОбъект.ВидЛояльности = Перечисления.ВидыЛояльностей.Бонусная;
	ИначеЕсли ОтветВСтруктуре1С.ВидЛояльности = 3 Тогда
      ДокОбъект.ВидЛояльности = Перечисления.ВидыЛояльностей.Реферальная;
	КонецЕсли;

	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Объект.ЗагруженныйОбъект = ДокОбъект.Ссылка; 
	Объект.СостояниеСообщения = Перечисления.СостоянияСообщенияОбменаСRabbit.Загружено;
	
КонецПроцедуры	